


//Переменные и типы данных, логический тип
fun main(args: Array<String>) {

    //Объявление переменных
    var bool: Boolean = false

    //Операции с логическим типом
    println("Логическое сложение ${ bool || true }")
    println("Логическое умножение ${ bool && true }")
    println("Логическое отрицание ${ !bool }")
    println("--------------------")


    //Другие операции, возвращающие значения логического типа
    println("Результат 1 > 2: ${ 1 > 2}")
    println("Результат 1 == 2: ${ 1 == 2}")
    println("Результат 1 != 2: ${ 1 != 2}")
    println("Результат !(1 == 2): ${ !(1 == 2) }")
    println("Результат !(1 == 2): ${ (1 == 2) || bool }")


    //Логический тип и условия в конструкциях
    if (bool) {
        //action
    }

    while (bool || false) {
        //action
    }
}