

//Переменные и типы данных, символы и строки
fun main(args: Array<String>) {

    //Объявление переменных
    var char: Char = 'c'
    var str: String = "string"

    //--------------------------------------------

    //Коды символов и операции с Char
    println("Код символа 'c': ${ char.toInt() }")
    println("Код символа, следующего за 'c': ${(char.toInt() + 1).toChar() }")
    println("--------------------")

    //--------------------------------------------

    //Операции со строками
    str += " concat"
    println("Сложение строк: $str")

    //--------------------------------------------

    println("Сложение строки и символа: ${ str + char }")
}